app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "1"], ["room_number", 1], ["created_at", "2020-03-14 05:03:17.790320"], ["updated_at", "2020-03-14 05:03:17.790320"]]
---
  def create
      @school_class = SchoolClass.new(post_params(:title, :room_number))
      @school_class.save